<script lang="ts">
	let currentYear = new Date().getFullYear();
</script>

<div class="footer">
	<div class="footer__inner">
		<div class="footer__navigation-row">
			<div class="footer__nav-group">
				<h2 class="footer__nav-heading">Find Parts</h2>
				<ul class="nav-items">
					<li class="nav-item">
						<a href="" class="nav-link">
							<span class="nav-link__label">Shop By Category</span>
						</a>
					</li>
					<li class="nav-item">
						<a href="" class="nav-link">
							<span class="nav-link__label">Parts Manual</span>
						</a>
					</li>
					<li class="nav-item">
						<a href="" class="nav-link">
							<span class="nav-link__label">SIS</span>
						</a>
					</li>
					<li class="nav-item">
						<a href="" class="nav-link">
							<span class="nav-link__label">About Cat Parts</span>
						</a>
					</li>
					<li class="nav-item">
						<a href="" class="nav-link">
							<span class="nav-link__label">Site Map</span>
						</a>
					</li>
				</ul>
			</div>
			<div class="footer__nav-group">
				<h2 class="footer__nav-heading">Support</h2>
				<ul class="nav-items">
					<li class="nav-item">
						<a href="" class="nav-link">
							<span class="nav-link__label">Contact Us</span>
						</a>
					</li>
					<li class="nav-item">
						<a href="" class="nav-link">
							<span class="nav-link__label">Find Your Dealer</span>
						</a>
					</li>
					<li class="nav-item">
						<a href="" class="nav-link">
							<span class="nav-link__label">Help Center</span>
						</a>
					</li>
					<li class="nav-item">
						<a href="" class="nav-link">
							<span class="nav-link__label">Warranty & Returns</span>
						</a>
					</li>
				</ul>
			</div>
			<div class="footer__nav-group">
				<h2 class="footer__nav-heading">My Account</h2>
				<ul class="nav-items">
					<li class="nav-item">
						<a href="#" class="nav-link">Shopping Cart</a>
					</li>
				</ul>
			</div>
			<div class="footer__nav-group">
				<h2 class="footer__nav-heading">Cat Social</h2>
				<ul class="nav-items">
					<li class="nav-item">
						<a href="" class="nav-link">
							<svg
								width="24"
								height="24"
								viewBox="0 0 24 24"
								xmlns="http://www.w3.org/2000/svg"
								aria-hidden="true"
								role=""
							>
								<g clip-path="url(#clip0_13883_3182)">
									<path
										d="M21.3 23.8H16.2C15.8 23.8 15.4 23.5 15.4 23V14.9C15.4 14.5 15.7 14.1 16.2 14.1H17.4C17.6 14.1 17.7 14 17.7 13.8V12.5C17.7 12.3 17.6 12.2 17.4 12.2H16.3C15.9 12.2 15.5 11.9 15.5 11.4V9.9C15.5 7.7 16.9 7.7 17.6 7.7H18.4C18.5 7.7 18.5 7.7 18.6 7.6C18.7 7.5 18.7 7.4 18.7 7.4V6.1C18.7 6 18.6 5.9 18.6 5.9C18.6 5.9 18.5 5.8 18.4 5.8H16.5C14.7 5.7 13.2 7.1 13.1 8.9C13.1 9.1 13.1 9.2 13.1 9.4V11.5C13.1 11.9 12.8 12.3 12.4 12.3H11.3C11.2 12.3 11.1 12.4 11.1 12.4C11.1 12.4 11 12.5 11 12.6V13.9C11 14.1 11.1 14.2 11.3 14.2H12.4C12.8 14.2 13.1 14.5 13.1 15V23.1C13.1 23.5 12.8 23.9 12.4 23.9H2.5C1.1 23.9 0 22.8 0 21.4V2.5C0 1.1 1.1 0 2.5 0H21.4C22.8 0 23.9 1.1 23.9 2.5V21.4C23.8 22.7 22.7 23.8 21.3 23.8ZM16.9 22.3H21.3C21.8 22.3 22.3 21.9 22.3 21.3V2.5C22.3 2 21.9 1.5 21.3 1.5H2.5C2 1.5 1.5 1.9 1.5 2.5V21.4C1.5 21.9 1.9 22.4 2.5 22.4H11.6V15.8H11.3C10.3 15.8 9.5 15 9.5 14V12.7C9.5 11.7 10.4 10.9 11.3 10.9H11.6V9.5C11.6 9.3 11.6 9.1 11.6 8.8C11.7 6.2 13.9 4.1 16.5 4.3H18.4C18.9 4.3 19.4 4.5 19.7 4.9C20 5.3 20.2 5.7 20.2 6.2V7.4C20.2 7.9 20 8.3 19.7 8.7C19.4 9 18.9 9.2 18.4 9.2H17.6C17.5 9.2 17.2 9.2 17.1 9.2C17.1 9.2 17 9.3 17 9.9V10.8H17.4C18.4 10.8 19.2 11.6 19.2 12.6V13.9C19.2 14.9 18.4 15.7 17.4 15.7H16.9V22.3Z"
									></path>
								</g>
								<defs>
									<clipPath id="clip0_13883_3182">
										<rect width="24" height="24"></rect>
									</clipPath>
								</defs>
							</svg>
							<span class="nav-link__label">Facebook</span>
						</a>
					</li>
					<li class="nav-item">
						<a href="" class="nav-link">
							<svg
								width="24"
								height="24"
								viewBox="0 0 24 24"
								xmlns="http://www.w3.org/2000/svg"
								aria-hidden="true"
								role=""
							>
								<path
									fill-rule="evenodd"
									clip-rule="evenodd"
									d="M4.54231 1.00016C4.53254 0.99995 4.52277 0.999947 4.51301 1.00015C3.80311 1.01498 3.12544 1.29934 2.61752 1.79551C2.10959 2.29169 1.80946 2.96252 1.77802 3.67187C1.77743 3.68538 1.77722 3.69891 1.77741 3.71244C1.78771 4.43764 2.07626 5.13116 2.5834 5.64964C3.09055 6.16813 3.77752 6.47193 4.50231 6.49826C4.51596 6.49876 4.52963 6.49885 4.54328 6.49854C5.27334 6.48192 5.96759 6.17891 6.47619 5.6549C6.9848 5.13088 7.26696 4.4279 7.26178 3.69767C7.26173 3.69075 7.26157 3.68383 7.26132 3.67692C7.23507 2.9681 6.93891 2.29612 6.43344 1.79851C5.92798 1.30091 5.25145 1.0153 4.54231 1.00016ZM3.58699 2.78794C3.83939 2.54137 4.175 2.39862 4.52732 2.3876C4.87726 2.39875 5.21038 2.54131 5.46014 2.78718C5.71091 3.03405 5.85885 3.36659 5.87448 3.71789C5.87436 4.08022 5.73319 4.42844 5.48065 4.68863C5.23045 4.94642 4.89061 5.09751 4.53215 5.11092C4.17052 5.09262 3.82874 4.93874 3.5752 4.67953C3.32161 4.42027 3.17532 4.07509 3.16507 3.71307C3.18562 3.36317 3.33592 3.0332 3.58699 2.78794ZM3.3851 9.54062C3.3851 9.36037 3.40777 9.27275 3.41998 9.2387L3.42008 9.23867C3.47712 9.22048 3.58459 9.20529 3.79415 9.20417C3.89373 9.20364 4.0013 9.20601 4.12647 9.20886L4.13208 9.20898C4.25266 9.21173 4.38715 9.21478 4.5275 9.21478C4.66813 9.21478 4.80264 9.21171 4.92302 9.20897L4.9279 9.20886C5.05269 9.20601 5.15956 9.20364 5.25834 9.20417C5.46039 9.20526 5.56458 9.21965 5.61975 9.23639C5.63213 9.27221 5.65404 9.36113 5.65404 9.54062V21.3118C5.65404 21.4676 5.63762 21.5532 5.62609 21.5942C5.5659 21.6073 5.46076 21.6156 5.26914 21.6118C5.21042 21.6106 5.13303 21.6078 5.04608 21.6046H5.04603C4.88655 21.5987 4.69495 21.5917 4.5275 21.5917C4.36048 21.5917 4.16889 21.5987 4.00891 21.6046H4.00887C3.92114 21.6078 3.84292 21.6106 3.78347 21.6118C3.58414 21.6157 3.47567 21.6068 3.41358 21.5924C3.40206 21.5528 3.3851 21.4682 3.3851 21.3118V9.54062ZM4.5275 7.82742C4.40325 7.82742 4.28228 7.82468 4.158 7.82185L4.15517 7.82179H4.15514C4.03486 7.81905 3.90833 7.81617 3.78672 7.81683C3.55198 7.81808 3.26712 7.83124 2.99853 7.9169C2.70312 8.01111 2.41936 8.19577 2.22902 8.52216C2.05352 8.8231 1.99774 9.17697 1.99774 9.54062V21.3118C1.99774 21.6782 2.05401 22.0373 2.23709 22.3396C2.43726 22.6702 2.73373 22.8444 3.03078 22.9263C3.29902 23.0003 3.58304 23.0034 3.81078 22.9989C3.92571 22.9966 4.02313 22.9928 4.11712 22.9891L4.11727 22.9891C4.24805 22.9839 4.37217 22.979 4.5275 22.979C4.68304 22.979 4.80701 22.9839 4.93751 22.9891L4.93763 22.9891C5.03097 22.9928 5.12766 22.9966 5.24164 22.9989C5.46769 23.0034 5.75091 23.0004 6.01838 22.9257C6.31595 22.8426 6.61001 22.6663 6.80715 22.3352C6.98668 22.0338 7.0414 21.6763 7.0414 21.3118V9.54062C7.0414 9.17884 6.98718 8.82658 6.81514 8.52655C6.62784 8.1999 6.34665 8.01314 6.05089 7.91765C5.78305 7.83118 5.49898 7.81808 5.26582 7.81683C5.14507 7.81617 5.01927 7.81905 4.89963 7.82178H4.89962L4.89626 7.82185C4.77244 7.82468 4.65173 7.82742 4.5275 7.82742ZM14.8536 9.27555C15.3607 9.04935 15.9173 8.95704 16.4702 9.00746C16.5052 9.01065 16.5404 9.01118 16.5755 9.00904C17.1376 8.97472 17.7006 9.05901 18.228 9.25644C18.7554 9.45388 19.2354 9.76003 19.6367 10.155C20.0381 10.55 20.3519 11.025 20.5578 11.5492C20.7636 12.0734 20.8569 12.635 20.8316 13.1975C20.8311 13.2079 20.8309 13.2183 20.8309 13.2287V21.2643C20.8309 21.4194 20.8151 21.5056 20.8036 21.5479C20.7439 21.5601 20.64 21.568 20.452 21.5643C20.3928 21.5632 20.3152 21.5603 20.228 21.5571H20.2279L20.2278 21.5571C20.067 21.5512 19.8736 21.5442 19.7028 21.5442C19.5322 21.5442 19.3389 21.5512 19.1783 21.5571H19.1782C19.0911 21.5603 19.0136 21.5632 18.9545 21.5643C18.7669 21.568 18.6631 21.5601 18.6035 21.5479C18.5921 21.5057 18.5762 21.4194 18.5762 21.2643V15.0129C18.6068 14.6012 18.5506 14.1875 18.4113 13.7986C18.2685 13.3999 18.0416 13.0365 17.7459 12.7332C17.4503 12.4299 17.0929 12.1938 16.6979 12.0408C16.3122 11.8913 15.8995 11.8247 15.4865 11.8449C15.0759 11.8382 14.6681 11.9168 14.2892 12.0758C13.9012 12.2386 13.5522 12.482 13.2654 12.79C12.9785 13.0979 12.7605 13.4633 12.6256 13.8619C12.4946 14.2492 12.445 14.6591 12.4798 15.0662V21.3119C12.4798 21.4675 12.4634 21.5529 12.4519 21.5937C12.3905 21.6072 12.2835 21.6157 12.088 21.6119C12.0283 21.6107 11.95 21.6079 11.8622 21.6047L11.8619 21.6047C11.7008 21.5988 11.5075 21.5917 11.3374 21.5917C11.1668 21.5917 10.9735 21.5988 10.8128 21.6047L10.8127 21.6047C10.7256 21.6079 10.6481 21.6107 10.5891 21.6119C10.4014 21.6156 10.2977 21.6077 10.2381 21.5955C10.2267 21.5533 10.2108 21.467 10.2108 21.3119V9.58928C10.2119 9.57371 10.2124 9.55804 10.2124 9.54228C10.2124 9.34562 10.2407 9.25775 10.2531 9.22848C10.2619 9.22547 10.2756 9.22147 10.2959 9.21747L10.298 9.21704C10.3285 9.21088 10.4302 9.20087 10.6202 9.19714C10.7951 9.19371 11.0042 9.19594 11.2236 9.20082C11.3949 9.20463 11.5794 9.21038 11.7541 9.21583H11.7542L11.7547 9.21584C11.9292 9.22128 12.0938 9.2264 12.2255 9.22898L12.2332 9.24775C12.2947 9.4041 12.3307 9.6435 12.3246 9.86577C12.3163 10.1681 12.5049 10.441 12.7906 10.5401C13.0764 10.6393 13.3934 10.5419 13.5742 10.2994C13.9061 9.85427 14.3466 9.50174 14.8536 9.27555ZM9.12731 8.41393C8.90916 8.72121 8.83194 9.0967 8.82549 9.4875C8.82414 9.5051 8.82346 9.52284 8.82346 9.5407V21.3119C8.82346 21.6744 8.8766 22.0307 9.0533 22.3316C9.2482 22.6636 9.54089 22.8416 9.83946 22.9255C10.1067 23.0006 10.3902 23.0035 10.6165 22.999C10.7298 22.9967 10.8266 22.993 10.9204 22.9893C11.0527 22.9841 11.179 22.9791 11.3374 22.9791C11.4955 22.9791 11.622 22.9841 11.7547 22.9892C11.8491 22.9929 11.9466 22.9967 12.0608 22.999C12.2888 23.0035 12.5731 23.0005 12.8411 22.9261C13.1391 22.8434 13.4342 22.6676 13.6322 22.3361C13.8124 22.0342 13.8671 21.6763 13.8671 21.3119V15.0347C13.8671 15.0121 13.866 14.9896 13.8638 14.9672C13.842 14.7441 13.8679 14.5189 13.9398 14.3066C14.0116 14.0942 14.1278 13.8996 14.2806 13.7355C14.4334 13.5715 14.6193 13.4418 14.826 13.3551C15.0327 13.2683 15.2555 13.2265 15.4796 13.2324C15.4993 13.233 15.5191 13.2326 15.5388 13.2315C15.763 13.2182 15.9874 13.2533 16.1968 13.3344C16.4062 13.4156 16.5957 13.5408 16.7524 13.7016C16.9092 13.8624 17.0295 14.055 17.1052 14.2665C17.181 14.4779 17.2103 14.7031 17.1914 14.9269C17.1897 14.9464 17.1889 14.9659 17.1889 14.9855V21.2643C17.1889 21.6269 17.242 21.9831 17.4187 22.2841C17.6136 22.616 17.9063 22.794 18.2049 22.8779C18.4721 22.953 18.7556 22.9559 18.9819 22.9514C19.0952 22.9492 19.192 22.9454 19.2858 22.9417L19.2859 22.9417C19.4182 22.9365 19.5445 22.9315 19.7028 22.9315C19.8613 22.9315 19.9879 22.9365 20.1204 22.9417L20.1205 22.9417L20.1206 22.9417C20.2144 22.9454 20.3113 22.9492 20.4246 22.9514C20.651 22.9559 20.9347 22.953 21.202 22.878C21.5006 22.7941 21.7934 22.6161 21.9883 22.2841C22.1651 21.9832 22.2183 21.6269 22.2183 21.2643V13.2438C22.2498 12.4922 22.1241 11.7423 21.8491 11.0421C21.5721 10.3368 21.1499 9.69767 20.6099 9.16619C20.0698 8.63472 19.424 8.22279 18.7144 7.95714C18.0212 7.69762 17.2822 7.58339 16.5433 7.62131C15.7714 7.55984 14.9961 7.69284 14.2884 8.00854C13.9797 8.14625 13.6883 8.31677 13.4188 8.51635C13.2448 8.20348 12.9223 7.84336 12.3743 7.84336C12.2473 7.84336 12.0615 7.83745 11.8394 7.83039L11.8394 7.83039C11.6634 7.82479 11.4647 7.81848 11.2545 7.8138C11.0283 7.80877 10.7967 7.80605 10.593 7.81005C10.4049 7.81374 10.1907 7.82352 10.0248 7.85683C9.71096 7.91929 9.36993 8.0722 9.12731 8.41393Z"
								></path>
							</svg>
							<span class="nav-link__label">LinkedIn</span>
						</a>
					</li>
					<li class="nav-item">
						<a href="" class="nav-link">
							<svg
								width="24"
								height="24"
								viewBox="0 0 24 24"
								xmlns="http://www.w3.org/2000/svg"
								aria-hidden="true"
								role=""
							>
								<path
									fill-rule="evenodd"
									clip-rule="evenodd"
									d="M1.5 7.17857C1.5 5.69924 2.69924 4.5 4.17857 4.5H19.6071C21.0865 4.5 22.2857 5.69924 22.2857 7.17857V17.4643C22.2857 18.9436 21.0865 20.1429 19.6071 20.1429H4.17857C2.69924 20.1429 1.5 18.9436 1.5 17.4643V7.17857ZM4.17857 3C1.87081 3 0 4.87081 0 7.17857V17.4643C0 19.772 1.87081 21.6429 4.17857 21.6429H19.6071C21.9149 21.6429 23.7857 19.772 23.7857 17.4643V7.17857C23.7857 4.87081 21.9149 3 19.6071 3H4.17857ZM15.7208 12.707L9.74541 16.1926V9.22132L15.7208 12.707ZM9.70168 7.66067C9.44375 7.65375 9.18881 7.71733 8.96432 7.84454C8.73982 7.97175 8.55428 8.15778 8.42766 8.38261C8.30318 8.60364 8.24028 8.85393 8.24541 9.10738V16.2956C8.24384 16.5474 8.3085 16.7951 8.43292 17.014C8.558 17.2341 8.73904 17.4172 8.95768 17.5447C9.17631 17.6722 9.42479 17.7397 9.67791 17.7403C9.93104 17.7408 10.1798 17.6745 10.399 17.5479L16.5733 13.9462L16.575 13.9453C16.7908 13.8186 16.9699 13.6377 17.0943 13.4205C17.2187 13.2032 17.2841 12.9573 17.2841 12.707C17.2841 12.4567 17.2187 12.2107 17.0943 11.9935C16.9699 11.7763 16.7908 11.5953 16.575 11.4687L10.4127 7.87402C10.1989 7.74111 9.95354 7.66741 9.70168 7.66067ZM8.24541 9.10738V9.0984L8.24573 9.12046L8.24541 9.10738Z"
								></path>
							</svg>
							<span class="nav-link__label">Youtube</span>
						</a>
					</li>
					<li class="nav-item">
						<a href="" class="nav-link">
							<svg
								width="24"
								height="24"
								viewBox="0 0 24 24"
								xmlns="http://www.w3.org/2000/svg"
								aria-hidden="true"
								role=""
							>
								<path
									d="M13.695 10.2308L21.636 1H19.7543L12.8591 9.01498L7.35188 1H1L9.32793 13.1201L1 22.8H2.88188L10.1634 14.3359L15.9794 22.8H22.3312L13.6945 10.2308H13.695ZM11.1175 13.2269L10.2737 12.02L3.55995 2.41665H6.4504L11.8685 10.1668L12.7123 11.3737L19.7551 21.4478H16.8647L11.1175 13.2273V13.2269Z"
								></path>
							</svg>
							<span class="nav-link__label">@CaterpillarInc</span>
						</a>
					</li>
					<li class="nav-item">
						<a href="" class="nav-link">
							<svg
								width="24"
								height="24"
								viewBox="0 0 24 24"
								xmlns="http://www.w3.org/2000/svg"
								aria-hidden="true"
								role=""
							>
								<path
									fill-rule="evenodd"
									clip-rule="evenodd"
									d="M6.2 23.1H17.9C20.8 23.1 23.1 20.8 23.2 18V6.2C23.2 3.3 20.8 1 18 1H6.2C3.3 1 1 3.3 1 6.2V17.9C1 20.8 3.4 23.1 6.2 23.1ZM2.5 6.2C2.5 4.1 4.2 2.5 6.2 2.5H18C20.1 2.5 21.7 4.2 21.7 6.2V18C21.7 20.1 20 21.7 18 21.7H6.2C4.1 21.7 2.5 20 2.5 18V6.2ZM7 12.1C7 14.9 9.3 17.2 12.1 17.2C14.9 17.2 17.2 14.9 17.2 12.1C17.2 9.3 14.9 7 12.1 7C9.3 7 7 9.3 7 12.1ZM8.5 12C8.5 10 10.1 8.4 12.1 8.4C14.1 8.4 15.7 10 15.7 12C15.7 14 14.1 15.6 12.1 15.6C10.1 15.6 8.5 14 8.5 12ZM17.0996 6.19961C17.0996 6.69961 17.4996 7.09961 17.9996 7.09961C18.5996 7.09961 18.9996 6.69961 18.9996 6.09961C18.9996 5.59961 18.5996 5.09961 17.9996 5.09961C17.4996 5.09961 17.0996 5.49961 17.0996 5.99961V6.09961V6.19961Z"
								></path>
							</svg>
							<span class="nav-link__label">Instagram</span>
						</a>
					</li>
					<li class="nav-item">
						<a href="" class="nav-link">
							<span class="nav-link__label">All Social Media Accounts</span>
						</a>
					</li>
				</ul>
			</div>
		</div>
		<div class="footer__lang-row">
			<ul class="lang-list">
				<li class="lang-item">
					<a href="" class="lang-link selected">United States English</a>
				</li>
				<li class="lang-item">
					<a href="" class="lang-link">العربية</a>
				</li>
				<li class="lang-item">
					<a href="" class="lang-link">Bahasa Indonesia</a>
				</li>
				<li class="lang-item">
					<a href="" class="lang-link">Português do Brasil</a>
				</li>
				<li class="lang-item">
					<a href="" class="lang-link">体中文</a>
				</li>
				<li class="lang-item">
					<a href="" class="lang-link">Español (Latino)</a>
				</li>
				<li class="lang-item">
					<a href="" class="lang-link">Français</a>
				</li>
				<li class="lang-item">
					<a href="" class="lang-link">Deutsch</a>
				</li>
				<li class="lang-item">
					<a href="" class="lang-link">한국어</a>
				</li>
				<li class="lang-item">
					<a href="" class="lang-link">Nederlands</a>
				</li>
				<li class="lang-item">
					<a href="" class="lang-link">Norsk</a>
				</li>
				<li class="lang-item">
					<a href="" class="lang-link">Polski</a>
				</li>
				<li class="lang-item">
					<a href="" class="lang-link">Русский</a>
				</li>
				<li class="lang-item">
					<a href="" class="lang-link">Svenska</a>
				</li>
				<li class="lang-item">
					<a href="" class="lang-link">Türkçe</a>
				</li>
				<li class="lang-item">
					<a href="" class="lang-link">Čeština</a>
				</li>
			</ul>
		</div>
		<div class="footer__legal-row">
			<ul class="legal-links">
				<li class="legal-item">
					<a href="" class="legal-link">About Cat</a>
				</li>
				<li class="legal-item">
					<a href="" class="legal-link">Site map</a>
				</li>
				<li class="legal-item">
					<a href="" class="legal-link">My Marketing Preferences</a>
				</li>
				<li class="legal-item">
					<a href="" class="legal-link">Cookie Settings</a>
				</li>
				<li class="legal-item">
					<a href="" class="legal-link">Legal</a>
				</li>
				<li class="legal-item">
					<a href="" class="legal-link">Privacy Notice</a>
				</li>
				<li class="legal-item">
					<a href="" class="legal-link">Dealer Terms & Conditions</a>
				</li>
				<li class="legal-item">
					<a href="" class="legal-link">Dealer Privacy Policy</a>
				</li>
				<li class="legal-item">
					<a href="" class="legal-link">Do Not Sell or Share My Personal Information</a>
				</li>
			</ul>
			<p class="copyright">Caterpillar© {currentYear} All Rights Reserved</p>
		</div>
	</div>
</div>

<style>
	.footer {
		align-items: center;
		border-top: 4px solid #f2f2f2;
		display: flex;
		justify-content: center;
		padding: 48px 16px;
	}

	.footer__inner {
		display: flex;
		flex-direction: column;
		gap: 24px;
		width: 100%;
		max-width: 1200px;
	}

	.footer__navigation-row {
		display: grid;
		gap: 16px;
		grid-template-columns: repeat(auto-fit, minmax(min(200px, 100%), 1fr));
	}

	.nav-items {
		display: flex;
		flex-direction: column;
		gap: 8px;
		list-style: none;
		margin: 0;
		padding: 0;
	}

	.nav-link:hover,
	.nav-link:focus {
		text-decoration: underline;
	}

	.nav-link svg {
		fill: currentColor;
		height: 16px;
		width: 16px;
	}

	.lang-list {
		display: flex;
		flex-wrap: wrap;
		gap: 8px 24px;
		list-style: none;
		margin: 0;
		padding: 0;
	}

	.lang-item {
		display: flex;
	}

	.lang-link {
		font-size: 0.75rem;
		font-weight: 600;
		padding: 8px;
		transition: all 0.25s ease-in-out;
	}

	.lang-link:hover,
	.lang-link:focus {
		background: #3f3f3f;
		color: #ffffff;
	}

	.lang-link.selected {
		border-bottom: 2px solid #000;
	}

	.footer__legal-row {
		align-items: center;
		border-top: 2px solid #f2f2f2;
		display: flex;
		flex-direction: row;
		gap: 32px;
		justify-content: space-between;
		padding-block-start: 16px;
	}

	.legal-links {
		display: flex;
		flex-wrap: wrap;
		gap: 8px 0;
		list-style: none;
		margin: 0;
		max-width: 100%;
		padding: 0;
		width: 750px;
	}

	.legal-item {
		border-inline-end: 1px solid #000000;
		display: flex;
		padding-inline: 8px;
	}

	.legal-item:last-child {
		border: none;
	}

	.legal-link {
		font-size: 0.75rem;
	}

	.legal-link:hover,
	.legal-link:focus {
		text-decoration: underline;
	}

	.copyright {
		font-size: 0.75rem;
		margin: 0;
	}
</style>
